import imagePath from "../images/vat.png";
import imagePath2 from '../images/cross_border_contract.png'
const data = [
  {
    name: '增值税发票',
    staticName: 'vat',
    documents:[
      {
        name: "vat1",
        data: [
          {
            isexample: true,
            taskId: "U2024011209740513",
            status: 1,
            fileName: "vat.png",
            imagePath,
            height: 1560,
            width: 2080,
            content: [
              {
                info: [
                  {
                    id: 1,
                    key: "发票代码",
                    position: [
                      [
                        {
                          x: 258,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 351,
                        },
                        {
                          x: 258,
                          y: 351,
                        },
                      ],
                    ],
                    value: "5000210330",
                  },
                  {
                    id: 2,
                    key: "发票号码",
                    position: [
                      [
                        {
                          x: 1433,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 398,
                        },
                        {
                          x: 1433,
                          y: 398,
                        },
                      ],
                    ],
                    value: "22968322",
                  },
                  {
                    id: 3,
                    key: "发票日期",
                    position: [
                      [
                        {
                          x: 1703,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 455,
                        },
                        {
                          x: 1703,
                          y: 455,
                        },
                      ],
                    ],
                    value: "2021年06月05日",
                  },
                  {
                    id: 4,
                    key: "校验码（后六位）",
                    position: [[]],
                    value: "",
                  },
                  {
                    id: 5,
                    key: "购买方名称",
                    position: [
                      [
                        {
                          x: 568,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 538,
                        },
                        {
                          x: 568,
                          y: 538,
                        },
                      ],
                    ],
                    value: "材料有限公司",
                  },
                  {
                    id: 6,
                    key: "购买方纳税人识别号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 593,
                        },
                        {
                          x: 380,
                          y: 593,
                        },
                      ],
                    ],
                    value: "91347583MA3TDEF5N",
                  },
                  {
                    id: 7,
                    key: "购买方地址及电话",
                    position: [
                      [
                        {
                          x: 376,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 636,
                        },
                        {
                          x: 376,
                          y: 636,
                        },
                      ],
                    ],
                    value: "安徽省池州市010-93470823",
                  },
                  {
                    id: 8,
                    key: "购买方开户行及账号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 690,
                        },
                        {
                          x: 380,
                          y: 690,
                        },
                      ],
                    ],
                    value: "中国农业银行池州江南支行12984793403940814",
                  },
                  {
                    id: 9,
                    key: "销售方名称",
                    position: [
                      [
                        {
                          x: 644,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1257,
                        },
                        {
                          x: 644,
                          y: 1257,
                        },
                      ],
                    ],
                    value: "粘胶厂",
                  },
                  {
                    id: 10,
                    key: "销售方纳税人识别号",
                    position: [
                      [
                        {
                          x: 434,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1304,
                        },
                        {
                          x: 434,
                          y: 1304,
                        },
                      ],
                    ],
                    value: "917438480038080939",
                  },
                  {
                    id: 11,
                    key: "销售方地址及电话",
                    position: [
                      [
                        {
                          x: 392,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1346,
                        },
                        {
                          x: 392,
                          y: 1346,
                        },
                      ],
                    ],
                    value: "广州市白云区020-73905280",
                  },
                  {
                    id: 12,
                    key: "销售方开户行及账号",
                    position: [
                      [
                        {
                          x: 386,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1395,
                        },
                        {
                          x: 386,
                          y: 1395,
                        },
                      ],
                    ],
                    value: "广州农村商业银行白云新城支行3507034703020314",
                  },
                  {
                    id: 13,
                    key: "不含税总金额",
                    position: [
                      [
                        {
                          x: 1389,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1123,
                        },
                        {
                          x: 1389,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "75663.72",
                  },
                  {
                    id: 14,
                    key: "总税额",
                    position: [
                      [
                        {
                          x: 1797,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1123,
                        },
                        {
                          x: 1797,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "9836.28",
                  },
                  {
                    id: 15,
                    key: "价税合计大写",
                    position: [
                      [
                        {
                          x: 595,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1188,
                        },
                        {
                          x: 595,
                          y: 1188,
                        },
                      ],
                    ],
                    value: "捌万伍仟伍佰圆整",
                  },
                  {
                    id: 16,
                    key: "价税合计小写",
                    position: [
                      [
                        {
                          x: 1604,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1190,
                        },
                        {
                          x: 1604,
                          y: 1190,
                        },
                      ],
                    ],
                    value: "85500.00",
                  },
                  {
                    id: 17,
                    key: "密码区",
                    position: [
                      [
                        {
                          x: 1240,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 668,
                        },
                        {
                          x: 1240,
                          y: 668,
                        },
                      ],
                    ],
                    value:
                      "4*6<-30*065/+>5-6510*888*944<//343>88+-591/951><935-8+9++>68/985</>550+-5/17080/88/969244/5+-77<1<6<592>0>57",
                  },
                  {
                    id: 18,
                    key: "收款人",
                    position: [
                      [
                        {
                          x: 238,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1438,
                        },
                        {
                          x: 238,
                          y: 1438,
                        },
                      ],
                    ],
                    value: "贺",
                  },
                  {
                    id: 19,
                    key: "复核",
                    position: [
                      [
                        {
                          x: 731,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1440,
                        },
                        {
                          x: 731,
                          y: 1440,
                        },
                      ],
                    ],
                    value: "李",
                  },
                  {
                    id: 20,
                    key: "开票人",
                    position: [
                      [
                        {
                          x: 1198,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1448,
                        },
                        {
                          x: 1198,
                          y: 1448,
                        },
                      ],
                    ],
                    value: "肖",
                  },
                ],
                commodity: [
                  [
                    {
                      id: 1,
                      key: "商品名称",
                      position: [
                        [
                          {
                            x: 77,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 790,
                          },
                          {
                            x: 77,
                            y: 790,
                          },
                        ],
                      ],
                      value: "*化学合成材料*胶水",
                    },
                    {
                      id: 2,
                      key: "商品规格型号",
                      position: [
                        [
                          {
                            x: 554,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 792,
                          },
                          {
                            x: 554,
                            y: 792,
                          },
                        ],
                      ],
                      value: "802.62D",
                    },
                    {
                      id: 3,
                      key: "商品单位",
                      position: [
                        [
                          {
                            x: 839,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 796,
                          },
                          {
                            x: 839,
                            y: 796,
                          },
                        ],
                      ],
                      value: "KG",
                    },
                    {
                      id: 4,
                      key: "商品数量",
                      position: [
                        [
                          {
                            x: 1033,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 799,
                          },
                          {
                            x: 1033,
                            y: 799,
                          },
                        ],
                      ],
                      value: "2000",
                    },
                    {
                      id: 5,
                      key: "商品单价",
                      position: [
                        [
                          {
                            x: 1139,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 794,
                          },
                          {
                            x: 1139,
                            y: 794,
                          },
                        ],
                      ],
                      value: "37.831858407",
                    },
                    {
                      id: 6,
                      key: "商品金额",
                      position: [
                        [
                          {
                            x: 1470,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 796,
                          },
                          {
                            x: 1470,
                            y: 796,
                          },
                        ],
                      ],
                      value: "75663.72",
                    },
                    {
                      id: 7,
                      key: "商品税率",
                      position: [
                        [
                          {
                            x: 1645,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 798,
                          },
                          {
                            x: 1645,
                            y: 798,
                          },
                        ],
                      ],
                      value: "13%",
                    },
                    {
                      id: 8,
                      key: "商品税额",
                      position: [
                        [
                          {
                            x: 1873,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 803,
                          },
                          {
                            x: 1873,
                            y: 803,
                          },
                        ],
                      ],
                      value: "9836.28",
                    },
                  ],
                ],
                others: [
                  {
                    id: 1,
                    key: "发票联号",
                    position: [
                      [
                        {
                          x: 2014,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 944,
                        },
                        {
                          x: 2014,
                          y: 944,
                        },
                      ],
                    ],
                    value: "第一联:记账联",
                  },
                  {
                    id: 2,
                    key: "备注",
                    position: [[]],
                    value: "",
                  },
                ],
              },
            ],
            angle: 0,
            json: {},
          },
          {
            isexample: true,
            taskId: "U2024011209740513",
            status: 1,
            fileName: "vat.png",
            imagePath,
            height: 1560,
            width: 2080,
            content: [
              {
                info: [
                  {
                    id: 1,
                    key: "发票代码2",
                    position: [
                      [
                        {
                          x: 258,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 351,
                        },
                        {
                          x: 258,
                          y: 351,
                        },
                      ],
                    ],
                    value: "5000210330",
                  },
                  {
                    id: 2,
                    key: "发票号码2",
                    position: [
                      [
                        {
                          x: 1433,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 398,
                        },
                        {
                          x: 1433,
                          y: 398,
                        },
                      ],
                    ],
                    value: "22968322",
                  },
                  {
                    id: 3,
                    key: "发票日期",
                    position: [
                      [
                        {
                          x: 1703,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 455,
                        },
                        {
                          x: 1703,
                          y: 455,
                        },
                      ],
                    ],
                    value: "2021年06月05日",
                  },
                  {
                    id: 4,
                    key: "校验码（后六位）",
                    position: [[]],
                    value: "",
                  },
                  {
                    id: 5,
                    key: "购买方名称",
                    position: [
                      [
                        {
                          x: 568,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 538,
                        },
                        {
                          x: 568,
                          y: 538,
                        },
                      ],
                    ],
                    value: "材料有限公司",
                  },
                  {
                    id: 6,
                    key: "购买方纳税人识别号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 593,
                        },
                        {
                          x: 380,
                          y: 593,
                        },
                      ],
                    ],
                    value: "91347583MA3TDEF5N",
                  },
                  {
                    id: 7,
                    key: "购买方地址及电话",
                    position: [
                      [
                        {
                          x: 376,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 636,
                        },
                        {
                          x: 376,
                          y: 636,
                        },
                      ],
                    ],
                    value: "安徽省池州市010-93470823",
                  },
                  {
                    id: 8,
                    key: "购买方开户行及账号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 690,
                        },
                        {
                          x: 380,
                          y: 690,
                        },
                      ],
                    ],
                    value: "中国农业银行池州江南支行12984793403940814",
                  },
                  {
                    id: 9,
                    key: "销售方名称",
                    position: [
                      [
                        {
                          x: 644,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1257,
                        },
                        {
                          x: 644,
                          y: 1257,
                        },
                      ],
                    ],
                    value: "粘胶厂",
                  },
                  {
                    id: 10,
                    key: "销售方纳税人识别号",
                    position: [
                      [
                        {
                          x: 434,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1304,
                        },
                        {
                          x: 434,
                          y: 1304,
                        },
                      ],
                    ],
                    value: "917438480038080939",
                  },
                  {
                    id: 11,
                    key: "销售方地址及电话",
                    position: [
                      [
                        {
                          x: 392,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1346,
                        },
                        {
                          x: 392,
                          y: 1346,
                        },
                      ],
                    ],
                    value: "广州市白云区020-73905280",
                  },
                  {
                    id: 12,
                    key: "销售方开户行及账号",
                    position: [
                      [
                        {
                          x: 386,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1395,
                        },
                        {
                          x: 386,
                          y: 1395,
                        },
                      ],
                    ],
                    value: "广州农村商业银行白云新城支行3507034703020314",
                  },
                  {
                    id: 13,
                    key: "不含税总金额",
                    position: [
                      [
                        {
                          x: 1389,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1123,
                        },
                        {
                          x: 1389,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "75663.72",
                  },
                  {
                    id: 14,
                    key: "总税额",
                    position: [
                      [
                        {
                          x: 1797,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1123,
                        },
                        {
                          x: 1797,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "9836.28",
                  },
                  {
                    id: 15,
                    key: "价税合计大写",
                    position: [
                      [
                        {
                          x: 595,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1188,
                        },
                        {
                          x: 595,
                          y: 1188,
                        },
                      ],
                    ],
                    value: "捌万伍仟伍佰圆整",
                  },
                  {
                    id: 16,
                    key: "价税合计小写",
                    position: [
                      [
                        {
                          x: 1604,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1190,
                        },
                        {
                          x: 1604,
                          y: 1190,
                        },
                      ],
                    ],
                    value: "85500.00",
                  },
                  {
                    id: 17,
                    key: "密码区",
                    position: [
                      [
                        {
                          x: 1240,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 668,
                        },
                        {
                          x: 1240,
                          y: 668,
                        },
                      ],
                    ],
                    value:
                      "4*6<-30*065/+>5-6510*888*944<//343>88+-591/951><935-8+9++>68/985</>550+-5/17080/88/969244/5+-77<1<6<592>0>57",
                  },
                  {
                    id: 18,
                    key: "收款人",
                    position: [
                      [
                        {
                          x: 238,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1438,
                        },
                        {
                          x: 238,
                          y: 1438,
                        },
                      ],
                    ],
                    value: "贺",
                  },
                  {
                    id: 19,
                    key: "复核",
                    position: [
                      [
                        {
                          x: 731,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1440,
                        },
                        {
                          x: 731,
                          y: 1440,
                        },
                      ],
                    ],
                    value: "李",
                  },
                  {
                    id: 20,
                    key: "开票人",
                    position: [
                      [
                        {
                          x: 1198,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1448,
                        },
                        {
                          x: 1198,
                          y: 1448,
                        },
                      ],
                    ],
                    value: "肖",
                  },
                ],
                commodity: [
                  [
                    {
                      id: 1,
                      key: "商品名称",
                      position: [
                        [
                          {
                            x: 77,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 790,
                          },
                          {
                            x: 77,
                            y: 790,
                          },
                        ],
                      ],
                      value: "*化学合成材料*胶水",
                    },
                    {
                      id: 2,
                      key: "商品规格型号",
                      position: [
                        [
                          {
                            x: 554,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 792,
                          },
                          {
                            x: 554,
                            y: 792,
                          },
                        ],
                      ],
                      value: "802.62D",
                    },
                    {
                      id: 3,
                      key: "商品单位",
                      position: [
                        [
                          {
                            x: 839,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 796,
                          },
                          {
                            x: 839,
                            y: 796,
                          },
                        ],
                      ],
                      value: "KG",
                    },
                    {
                      id: 4,
                      key: "商品数量",
                      position: [
                        [
                          {
                            x: 1033,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 799,
                          },
                          {
                            x: 1033,
                            y: 799,
                          },
                        ],
                      ],
                      value: "2000",
                    },
                    {
                      id: 5,
                      key: "商品单价",
                      position: [
                        [
                          {
                            x: 1139,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 794,
                          },
                          {
                            x: 1139,
                            y: 794,
                          },
                        ],
                      ],
                      value: "37.831858407",
                    },
                    {
                      id: 6,
                      key: "商品金额",
                      position: [
                        [
                          {
                            x: 1470,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 796,
                          },
                          {
                            x: 1470,
                            y: 796,
                          },
                        ],
                      ],
                      value: "75663.72",
                    },
                    {
                      id: 7,
                      key: "商品税率",
                      position: [
                        [
                          {
                            x: 1645,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 798,
                          },
                          {
                            x: 1645,
                            y: 798,
                          },
                        ],
                      ],
                      value: "13%",
                    },
                    {
                      id: 8,
                      key: "商品税额",
                      position: [
                        [
                          {
                            x: 1873,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 803,
                          },
                          {
                            x: 1873,
                            y: 803,
                          },
                        ],
                      ],
                      value: "9836.28",
                    },
                  ],
                ],
                others: [
                  {
                    id: 1,
                    key: "发票联号",
                    position: [
                      [
                        {
                          x: 2014,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 944,
                        },
                        {
                          x: 2014,
                          y: 944,
                        },
                      ],
                    ],
                    value: "第一联:记账联",
                  },
                  {
                    id: 2,
                    key: "备注",
                    position: [[]],
                    value: "",
                  },
                ],
              },
            ],
            angle: 0,
            json: {},
          },
        ],
      },
      {
        name: "vat2",
        data: [
          {
            isexample: true,
            taskId: "U2024011209740513",
            status: 1,
            fileName: "vat2-vat1.png",
            imagePath,
            height: 1560,
            width: 2080,
            content: [
              {
                info: [
                  {
                    id: 1,
                    key: "发票代码",
                    position: [
                      [
                        {
                          x: 258,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 351,
                        },
                        {
                          x: 258,
                          y: 351,
                        },
                      ],
                    ],
                    value: "5000210330",
                  },
                  {
                    id: 2,
                    key: "发票号码",
                    position: [
                      [
                        {
                          x: 1433,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 398,
                        },
                        {
                          x: 1433,
                          y: 398,
                        },
                      ],
                    ],
                    value: "22968322",
                  },
                  {
                    id: 3,
                    key: "发票日期",
                    position: [
                      [
                        {
                          x: 1703,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 455,
                        },
                        {
                          x: 1703,
                          y: 455,
                        },
                      ],
                    ],
                    value: "2021年06月05日",
                  },
                  {
                    id: 4,
                    key: "校验码（后六位）",
                    position: [[]],
                    value: "",
                  },
                  {
                    id: 5,
                    key: "购买方名称",
                    position: [
                      [
                        {
                          x: 568,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 538,
                        },
                        {
                          x: 568,
                          y: 538,
                        },
                      ],
                    ],
                    value: "材料有限公司",
                  },
                  {
                    id: 6,
                    key: "购买方纳税人识别号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 593,
                        },
                        {
                          x: 380,
                          y: 593,
                        },
                      ],
                    ],
                    value: "91347583MA3TDEF5N",
                  },
                  {
                    id: 7,
                    key: "购买方地址及电话",
                    position: [
                      [
                        {
                          x: 376,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 636,
                        },
                        {
                          x: 376,
                          y: 636,
                        },
                      ],
                    ],
                    value: "安徽省池州市010-93470823",
                  },
                  {
                    id: 8,
                    key: "购买方开户行及账号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 690,
                        },
                        {
                          x: 380,
                          y: 690,
                        },
                      ],
                    ],
                    value: "中国农业银行池州江南支行12984793403940814",
                  },
                  {
                    id: 9,
                    key: "销售方名称",
                    position: [
                      [
                        {
                          x: 644,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1257,
                        },
                        {
                          x: 644,
                          y: 1257,
                        },
                      ],
                    ],
                    value: "粘胶厂",
                  },
                  {
                    id: 10,
                    key: "销售方纳税人识别号",
                    position: [
                      [
                        {
                          x: 434,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1304,
                        },
                        {
                          x: 434,
                          y: 1304,
                        },
                      ],
                    ],
                    value: "917438480038080939",
                  },
                  {
                    id: 11,
                    key: "销售方地址及电话",
                    position: [
                      [
                        {
                          x: 392,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1346,
                        },
                        {
                          x: 392,
                          y: 1346,
                        },
                      ],
                    ],
                    value: "广州市白云区020-73905280",
                  },
                  {
                    id: 12,
                    key: "销售方开户行及账号",
                    position: [
                      [
                        {
                          x: 386,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1395,
                        },
                        {
                          x: 386,
                          y: 1395,
                        },
                      ],
                    ],
                    value: "广州农村商业银行白云新城支行3507034703020314",
                  },
                  {
                    id: 13,
                    key: "不含税总金额",
                    position: [
                      [
                        {
                          x: 1389,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1123,
                        },
                        {
                          x: 1389,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "75663.72",
                  },
                  {
                    id: 14,
                    key: "总税额",
                    position: [
                      [
                        {
                          x: 1797,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1123,
                        },
                        {
                          x: 1797,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "9836.28",
                  },
                  {
                    id: 15,
                    key: "价税合计大写",
                    position: [
                      [
                        {
                          x: 595,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1188,
                        },
                        {
                          x: 595,
                          y: 1188,
                        },
                      ],
                    ],
                    value: "捌万伍仟伍佰圆整",
                  },
                  {
                    id: 16,
                    key: "价税合计小写",
                    position: [
                      [
                        {
                          x: 1604,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1190,
                        },
                        {
                          x: 1604,
                          y: 1190,
                        },
                      ],
                    ],
                    value: "85500.00",
                  },
                  {
                    id: 17,
                    key: "密码区",
                    position: [
                      [
                        {
                          x: 1240,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 668,
                        },
                        {
                          x: 1240,
                          y: 668,
                        },
                      ],
                    ],
                    value:
                      "4*6<-30*065/+>5-6510*888*944<//343>88+-591/951><935-8+9++>68/985</>550+-5/17080/88/969244/5+-77<1<6<592>0>57",
                  },
                  {
                    id: 18,
                    key: "收款人",
                    position: [
                      [
                        {
                          x: 238,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1438,
                        },
                        {
                          x: 238,
                          y: 1438,
                        },
                      ],
                    ],
                    value: "贺",
                  },
                  {
                    id: 19,
                    key: "复核",
                    position: [
                      [
                        {
                          x: 731,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1440,
                        },
                        {
                          x: 731,
                          y: 1440,
                        },
                      ],
                    ],
                    value: "李",
                  },
                  {
                    id: 20,
                    key: "开票人",
                    position: [
                      [
                        {
                          x: 1198,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1448,
                        },
                        {
                          x: 1198,
                          y: 1448,
                        },
                      ],
                    ],
                    value: "肖",
                  },
                ],
                commodity: [
                  [
                    {
                      id: 1,
                      key: "商品名称",
                      position: [
                        [
                          {
                            x: 77,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 790,
                          },
                          {
                            x: 77,
                            y: 790,
                          },
                        ],
                      ],
                      value: "*化学合成材料*胶水",
                    },
                    {
                      id: 2,
                      key: "商品规格型号",
                      position: [
                        [
                          {
                            x: 554,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 792,
                          },
                          {
                            x: 554,
                            y: 792,
                          },
                        ],
                      ],
                      value: "802.62D",
                    },
                    {
                      id: 3,
                      key: "商品单位",
                      position: [
                        [
                          {
                            x: 839,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 796,
                          },
                          {
                            x: 839,
                            y: 796,
                          },
                        ],
                      ],
                      value: "KG",
                    },
                    {
                      id: 4,
                      key: "商品数量",
                      position: [
                        [
                          {
                            x: 1033,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 799,
                          },
                          {
                            x: 1033,
                            y: 799,
                          },
                        ],
                      ],
                      value: "2000",
                    },
                    {
                      id: 5,
                      key: "商品单价",
                      position: [
                        [
                          {
                            x: 1139,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 794,
                          },
                          {
                            x: 1139,
                            y: 794,
                          },
                        ],
                      ],
                      value: "37.831858407",
                    },
                    {
                      id: 6,
                      key: "商品金额",
                      position: [
                        [
                          {
                            x: 1470,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 796,
                          },
                          {
                            x: 1470,
                            y: 796,
                          },
                        ],
                      ],
                      value: "75663.72",
                    },
                    {
                      id: 7,
                      key: "商品税率",
                      position: [
                        [
                          {
                            x: 1645,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 798,
                          },
                          {
                            x: 1645,
                            y: 798,
                          },
                        ],
                      ],
                      value: "13%",
                    },
                    {
                      id: 8,
                      key: "商品税额",
                      position: [
                        [
                          {
                            x: 1873,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 803,
                          },
                          {
                            x: 1873,
                            y: 803,
                          },
                        ],
                      ],
                      value: "9836.28",
                    },
                  ],
                ],
                others: [
                  {
                    id: 1,
                    key: "发票联号",
                    position: [
                      [
                        {
                          x: 2014,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 944,
                        },
                        {
                          x: 2014,
                          y: 944,
                        },
                      ],
                    ],
                    value: "第一联:记账联",
                  },
                  {
                    id: 2,
                    key: "备注",
                    position: [[]],
                    value: "",
                  },
                ],
              },
            ],
            angle: 0,
            json: {},
          },
          {
            isexample: true,
            taskId: "U2024011209740513",
            status: 1,
            fileName: "vat2-vat2.png",
            imagePath,
            height: 1560,
            width: 2080,
            content: [
              {
                info: [
                  {
                    id: 1,
                    key: "发票代码2",
                    position: [
                      [
                        {
                          x: 258,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 351,
                        },
                        {
                          x: 258,
                          y: 351,
                        },
                      ],
                    ],
                    value: "5000210330",
                  },
                  {
                    id: 2,
                    key: "发票号码2",
                    position: [
                      [
                        {
                          x: 1433,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 398,
                        },
                        {
                          x: 1433,
                          y: 398,
                        },
                      ],
                    ],
                    value: "22968322",
                  },
                  {
                    id: 3,
                    key: "发票日期",
                    position: [
                      [
                        {
                          x: 1703,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 455,
                        },
                        {
                          x: 1703,
                          y: 455,
                        },
                      ],
                    ],
                    value: "2021年06月05日",
                  },
                  {
                    id: 4,
                    key: "校验码（后六位）",
                    position: [[]],
                    value: "",
                  },
                  {
                    id: 5,
                    key: "购买方名称",
                    position: [
                      [
                        {
                          x: 568,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 538,
                        },
                        {
                          x: 568,
                          y: 538,
                        },
                      ],
                    ],
                    value: "材料有限公司",
                  },
                  {
                    id: 6,
                    key: "购买方纳税人识别号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 593,
                        },
                        {
                          x: 380,
                          y: 593,
                        },
                      ],
                    ],
                    value: "91347583MA3TDEF5N",
                  },
                  {
                    id: 7,
                    key: "购买方地址及电话",
                    position: [
                      [
                        {
                          x: 376,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 636,
                        },
                        {
                          x: 376,
                          y: 636,
                        },
                      ],
                    ],
                    value: "安徽省池州市010-93470823",
                  },
                  {
                    id: 8,
                    key: "购买方开户行及账号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 690,
                        },
                        {
                          x: 380,
                          y: 690,
                        },
                      ],
                    ],
                    value: "中国农业银行池州江南支行12984793403940814",
                  },
                  {
                    id: 9,
                    key: "销售方名称",
                    position: [
                      [
                        {
                          x: 644,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1257,
                        },
                        {
                          x: 644,
                          y: 1257,
                        },
                      ],
                    ],
                    value: "粘胶厂",
                  },
                  {
                    id: 10,
                    key: "销售方纳税人识别号",
                    position: [
                      [
                        {
                          x: 434,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1304,
                        },
                        {
                          x: 434,
                          y: 1304,
                        },
                      ],
                    ],
                    value: "917438480038080939",
                  },
                  {
                    id: 11,
                    key: "销售方地址及电话",
                    position: [
                      [
                        {
                          x: 392,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1346,
                        },
                        {
                          x: 392,
                          y: 1346,
                        },
                      ],
                    ],
                    value: "广州市白云区020-73905280",
                  },
                  {
                    id: 12,
                    key: "销售方开户行及账号",
                    position: [
                      [
                        {
                          x: 386,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1395,
                        },
                        {
                          x: 386,
                          y: 1395,
                        },
                      ],
                    ],
                    value: "广州农村商业银行白云新城支行3507034703020314",
                  },
                  {
                    id: 13,
                    key: "不含税总金额",
                    position: [
                      [
                        {
                          x: 1389,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1123,
                        },
                        {
                          x: 1389,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "75663.72",
                  },
                  {
                    id: 14,
                    key: "总税额",
                    position: [
                      [
                        {
                          x: 1797,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1123,
                        },
                        {
                          x: 1797,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "9836.28",
                  },
                  {
                    id: 15,
                    key: "价税合计大写",
                    position: [
                      [
                        {
                          x: 595,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1188,
                        },
                        {
                          x: 595,
                          y: 1188,
                        },
                      ],
                    ],
                    value: "捌万伍仟伍佰圆整",
                  },
                  {
                    id: 16,
                    key: "价税合计小写",
                    position: [
                      [
                        {
                          x: 1604,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1190,
                        },
                        {
                          x: 1604,
                          y: 1190,
                        },
                      ],
                    ],
                    value: "85500.00",
                  },
                  {
                    id: 17,
                    key: "密码区",
                    position: [
                      [
                        {
                          x: 1240,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 668,
                        },
                        {
                          x: 1240,
                          y: 668,
                        },
                      ],
                    ],
                    value:
                      "4*6<-30*065/+>5-6510*888*944<//343>88+-591/951><935-8+9++>68/985</>550+-5/17080/88/969244/5+-77<1<6<592>0>57",
                  },
                  {
                    id: 18,
                    key: "收款人",
                    position: [
                      [
                        {
                          x: 238,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1438,
                        },
                        {
                          x: 238,
                          y: 1438,
                        },
                      ],
                    ],
                    value: "贺",
                  },
                  {
                    id: 19,
                    key: "复核",
                    position: [
                      [
                        {
                          x: 731,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1440,
                        },
                        {
                          x: 731,
                          y: 1440,
                        },
                      ],
                    ],
                    value: "李",
                  },
                  {
                    id: 20,
                    key: "开票人",
                    position: [
                      [
                        {
                          x: 1198,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1448,
                        },
                        {
                          x: 1198,
                          y: 1448,
                        },
                      ],
                    ],
                    value: "肖",
                  },
                ],
                commodity: [
                  [
                    {
                      id: 1,
                      key: "商品名称",
                      position: [
                        [
                          {
                            x: 77,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 790,
                          },
                          {
                            x: 77,
                            y: 790,
                          },
                        ],
                      ],
                      value: "*化学合成材料*胶水",
                    },
                    {
                      id: 2,
                      key: "商品规格型号",
                      position: [
                        [
                          {
                            x: 554,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 792,
                          },
                          {
                            x: 554,
                            y: 792,
                          },
                        ],
                      ],
                      value: "802.62D",
                    },
                    {
                      id: 3,
                      key: "商品单位",
                      position: [
                        [
                          {
                            x: 839,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 796,
                          },
                          {
                            x: 839,
                            y: 796,
                          },
                        ],
                      ],
                      value: "KG",
                    },
                    {
                      id: 4,
                      key: "商品数量",
                      position: [
                        [
                          {
                            x: 1033,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 799,
                          },
                          {
                            x: 1033,
                            y: 799,
                          },
                        ],
                      ],
                      value: "2000",
                    },
                    {
                      id: 5,
                      key: "商品单价",
                      position: [
                        [
                          {
                            x: 1139,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 794,
                          },
                          {
                            x: 1139,
                            y: 794,
                          },
                        ],
                      ],
                      value: "37.831858407",
                    },
                    {
                      id: 6,
                      key: "商品金额",
                      position: [
                        [
                          {
                            x: 1470,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 796,
                          },
                          {
                            x: 1470,
                            y: 796,
                          },
                        ],
                      ],
                      value: "75663.72",
                    },
                    {
                      id: 7,
                      key: "商品税率",
                      position: [
                        [
                          {
                            x: 1645,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 798,
                          },
                          {
                            x: 1645,
                            y: 798,
                          },
                        ],
                      ],
                      value: "13%",
                    },
                    {
                      id: 8,
                      key: "商品税额",
                      position: [
                        [
                          {
                            x: 1873,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 803,
                          },
                          {
                            x: 1873,
                            y: 803,
                          },
                        ],
                      ],
                      value: "9836.28",
                    },
                  ],
                ],
                others: [
                  {
                    id: 1,
                    key: "发票联号",
                    position: [
                      [
                        {
                          x: 2014,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 944,
                        },
                        {
                          x: 2014,
                          y: 944,
                        },
                      ],
                    ],
                    value: "第一联:记账联",
                  },
                  {
                    id: 2,
                    key: "备注",
                    position: [[]],
                    value: "",
                  },
                ],
              },
            ],
            angle: 0,
            json: {},
          },
        ],
      },
    ]
  },
  {
    name: '合同',
    staticName: 'contract',
    documents:[
      {
        name: "vat1",
        data: [
          {
            isexample: true,
            taskId: "U2024011209740513",
            status: 1,
            fileName: "vat.png",
            imagePath:imagePath2,
            height: 1560,
            width: 2080,
            content: [
              {
                info: [
                  {
                    id: 1,
                    key: "发票代码",
                    position: [
                      [
                        {
                          x: 258,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 351,
                        },
                        {
                          x: 258,
                          y: 351,
                        },
                      ],
                    ],
                    value: "5000210330",
                  },
                  {
                    id: 2,
                    key: "发票号码",
                    position: [
                      [
                        {
                          x: 1433,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 398,
                        },
                        {
                          x: 1433,
                          y: 398,
                        },
                      ],
                    ],
                    value: "22968322",
                  },
                  {
                    id: 3,
                    key: "发票日期",
                    position: [
                      [
                        {
                          x: 1703,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 455,
                        },
                        {
                          x: 1703,
                          y: 455,
                        },
                      ],
                    ],
                    value: "2021年06月05日",
                  },
                  {
                    id: 4,
                    key: "校验码（后六位）",
                    position: [[]],
                    value: "",
                  },
                  {
                    id: 5,
                    key: "购买方名称",
                    position: [
                      [
                        {
                          x: 568,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 538,
                        },
                        {
                          x: 568,
                          y: 538,
                        },
                      ],
                    ],
                    value: "材料有限公司",
                  },
                  {
                    id: 6,
                    key: "购买方纳税人识别号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 593,
                        },
                        {
                          x: 380,
                          y: 593,
                        },
                      ],
                    ],
                    value: "91347583MA3TDEF5N",
                  },
                  {
                    id: 7,
                    key: "购买方地址及电话",
                    position: [
                      [
                        {
                          x: 376,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 636,
                        },
                        {
                          x: 376,
                          y: 636,
                        },
                      ],
                    ],
                    value: "安徽省池州市010-93470823",
                  },
                  {
                    id: 8,
                    key: "购买方开户行及账号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 690,
                        },
                        {
                          x: 380,
                          y: 690,
                        },
                      ],
                    ],
                    value: "中国农业银行池州江南支行12984793403940814",
                  },
                  {
                    id: 9,
                    key: "销售方名称",
                    position: [
                      [
                        {
                          x: 644,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1257,
                        },
                        {
                          x: 644,
                          y: 1257,
                        },
                      ],
                    ],
                    value: "粘胶厂",
                  },
                  {
                    id: 10,
                    key: "销售方纳税人识别号",
                    position: [
                      [
                        {
                          x: 434,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1304,
                        },
                        {
                          x: 434,
                          y: 1304,
                        },
                      ],
                    ],
                    value: "917438480038080939",
                  },
                  {
                    id: 11,
                    key: "销售方地址及电话",
                    position: [
                      [
                        {
                          x: 392,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1346,
                        },
                        {
                          x: 392,
                          y: 1346,
                        },
                      ],
                    ],
                    value: "广州市白云区020-73905280",
                  },
                  {
                    id: 12,
                    key: "销售方开户行及账号",
                    position: [
                      [
                        {
                          x: 386,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1395,
                        },
                        {
                          x: 386,
                          y: 1395,
                        },
                      ],
                    ],
                    value: "广州农村商业银行白云新城支行3507034703020314",
                  },
                  {
                    id: 13,
                    key: "不含税总金额",
                    position: [
                      [
                        {
                          x: 1389,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1123,
                        },
                        {
                          x: 1389,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "75663.72",
                  },
                  {
                    id: 14,
                    key: "总税额",
                    position: [
                      [
                        {
                          x: 1797,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1123,
                        },
                        {
                          x: 1797,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "9836.28",
                  },
                  {
                    id: 15,
                    key: "价税合计大写",
                    position: [
                      [
                        {
                          x: 595,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1188,
                        },
                        {
                          x: 595,
                          y: 1188,
                        },
                      ],
                    ],
                    value: "捌万伍仟伍佰圆整",
                  },
                  {
                    id: 16,
                    key: "价税合计小写",
                    position: [
                      [
                        {
                          x: 1604,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1190,
                        },
                        {
                          x: 1604,
                          y: 1190,
                        },
                      ],
                    ],
                    value: "85500.00",
                  },
                  {
                    id: 17,
                    key: "密码区",
                    position: [
                      [
                        {
                          x: 1240,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 668,
                        },
                        {
                          x: 1240,
                          y: 668,
                        },
                      ],
                    ],
                    value:
                      "4*6<-30*065/+>5-6510*888*944<//343>88+-591/951><935-8+9++>68/985</>550+-5/17080/88/969244/5+-77<1<6<592>0>57",
                  },
                  {
                    id: 18,
                    key: "收款人",
                    position: [
                      [
                        {
                          x: 238,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1438,
                        },
                        {
                          x: 238,
                          y: 1438,
                        },
                      ],
                    ],
                    value: "贺",
                  },
                  {
                    id: 19,
                    key: "复核",
                    position: [
                      [
                        {
                          x: 731,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1440,
                        },
                        {
                          x: 731,
                          y: 1440,
                        },
                      ],
                    ],
                    value: "李",
                  },
                  {
                    id: 20,
                    key: "开票人",
                    position: [
                      [
                        {
                          x: 1198,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1448,
                        },
                        {
                          x: 1198,
                          y: 1448,
                        },
                      ],
                    ],
                    value: "肖",
                  },
                ],
                commodity: [
                  [
                    {
                      id: 1,
                      key: "商品名称",
                      position: [
                        [
                          {
                            x: 77,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 790,
                          },
                          {
                            x: 77,
                            y: 790,
                          },
                        ],
                      ],
                      value: "*化学合成材料*胶水",
                    },
                    {
                      id: 2,
                      key: "商品规格型号",
                      position: [
                        [
                          {
                            x: 554,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 792,
                          },
                          {
                            x: 554,
                            y: 792,
                          },
                        ],
                      ],
                      value: "802.62D",
                    },
                    {
                      id: 3,
                      key: "商品单位",
                      position: [
                        [
                          {
                            x: 839,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 796,
                          },
                          {
                            x: 839,
                            y: 796,
                          },
                        ],
                      ],
                      value: "KG",
                    },
                    {
                      id: 4,
                      key: "商品数量",
                      position: [
                        [
                          {
                            x: 1033,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 799,
                          },
                          {
                            x: 1033,
                            y: 799,
                          },
                        ],
                      ],
                      value: "2000",
                    },
                    {
                      id: 5,
                      key: "商品单价",
                      position: [
                        [
                          {
                            x: 1139,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 794,
                          },
                          {
                            x: 1139,
                            y: 794,
                          },
                        ],
                      ],
                      value: "37.831858407",
                    },
                    {
                      id: 6,
                      key: "商品金额",
                      position: [
                        [
                          {
                            x: 1470,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 796,
                          },
                          {
                            x: 1470,
                            y: 796,
                          },
                        ],
                      ],
                      value: "75663.72",
                    },
                    {
                      id: 7,
                      key: "商品税率",
                      position: [
                        [
                          {
                            x: 1645,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 798,
                          },
                          {
                            x: 1645,
                            y: 798,
                          },
                        ],
                      ],
                      value: "13%",
                    },
                    {
                      id: 8,
                      key: "商品税额",
                      position: [
                        [
                          {
                            x: 1873,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 803,
                          },
                          {
                            x: 1873,
                            y: 803,
                          },
                        ],
                      ],
                      value: "9836.28",
                    },
                  ],
                ],
                others: [
                  {
                    id: 1,
                    key: "发票联号",
                    position: [
                      [
                        {
                          x: 2014,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 944,
                        },
                        {
                          x: 2014,
                          y: 944,
                        },
                      ],
                    ],
                    value: "第一联:记账联",
                  },
                  {
                    id: 2,
                    key: "备注",
                    position: [[]],
                    value: "",
                  },
                ],
              },
            ],
            angle: 0,
            json: {},
          },
          {
            isexample: true,
            taskId: "U2024011209740513",
            status: 1,
            fileName: "vat.png",
            imagePath,
            height: 1560,
            width: 2080,
            content: [
              {
                info: [
                  {
                    id: 1,
                    key: "发票代码2",
                    position: [
                      [
                        {
                          x: 258,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 351,
                        },
                        {
                          x: 258,
                          y: 351,
                        },
                      ],
                    ],
                    value: "5000210330",
                  },
                  {
                    id: 2,
                    key: "发票号码2",
                    position: [
                      [
                        {
                          x: 1433,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 398,
                        },
                        {
                          x: 1433,
                          y: 398,
                        },
                      ],
                    ],
                    value: "22968322",
                  },
                  {
                    id: 3,
                    key: "发票日期",
                    position: [
                      [
                        {
                          x: 1703,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 455,
                        },
                        {
                          x: 1703,
                          y: 455,
                        },
                      ],
                    ],
                    value: "2021年06月05日",
                  },
                  {
                    id: 4,
                    key: "校验码（后六位）",
                    position: [[]],
                    value: "",
                  },
                  {
                    id: 5,
                    key: "购买方名称",
                    position: [
                      [
                        {
                          x: 568,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 538,
                        },
                        {
                          x: 568,
                          y: 538,
                        },
                      ],
                    ],
                    value: "材料有限公司",
                  },
                  {
                    id: 6,
                    key: "购买方纳税人识别号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 593,
                        },
                        {
                          x: 380,
                          y: 593,
                        },
                      ],
                    ],
                    value: "91347583MA3TDEF5N",
                  },
                  {
                    id: 7,
                    key: "购买方地址及电话",
                    position: [
                      [
                        {
                          x: 376,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 636,
                        },
                        {
                          x: 376,
                          y: 636,
                        },
                      ],
                    ],
                    value: "安徽省池州市010-93470823",
                  },
                  {
                    id: 8,
                    key: "购买方开户行及账号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 690,
                        },
                        {
                          x: 380,
                          y: 690,
                        },
                      ],
                    ],
                    value: "中国农业银行池州江南支行12984793403940814",
                  },
                  {
                    id: 9,
                    key: "销售方名称",
                    position: [
                      [
                        {
                          x: 644,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1257,
                        },
                        {
                          x: 644,
                          y: 1257,
                        },
                      ],
                    ],
                    value: "粘胶厂",
                  },
                  {
                    id: 10,
                    key: "销售方纳税人识别号",
                    position: [
                      [
                        {
                          x: 434,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1304,
                        },
                        {
                          x: 434,
                          y: 1304,
                        },
                      ],
                    ],
                    value: "917438480038080939",
                  },
                  {
                    id: 11,
                    key: "销售方地址及电话",
                    position: [
                      [
                        {
                          x: 392,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1346,
                        },
                        {
                          x: 392,
                          y: 1346,
                        },
                      ],
                    ],
                    value: "广州市白云区020-73905280",
                  },
                  {
                    id: 12,
                    key: "销售方开户行及账号",
                    position: [
                      [
                        {
                          x: 386,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1395,
                        },
                        {
                          x: 386,
                          y: 1395,
                        },
                      ],
                    ],
                    value: "广州农村商业银行白云新城支行3507034703020314",
                  },
                  {
                    id: 13,
                    key: "不含税总金额",
                    position: [
                      [
                        {
                          x: 1389,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1123,
                        },
                        {
                          x: 1389,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "75663.72",
                  },
                  {
                    id: 14,
                    key: "总税额",
                    position: [
                      [
                        {
                          x: 1797,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1123,
                        },
                        {
                          x: 1797,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "9836.28",
                  },
                  {
                    id: 15,
                    key: "价税合计大写",
                    position: [
                      [
                        {
                          x: 595,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1188,
                        },
                        {
                          x: 595,
                          y: 1188,
                        },
                      ],
                    ],
                    value: "捌万伍仟伍佰圆整",
                  },
                  {
                    id: 16,
                    key: "价税合计小写",
                    position: [
                      [
                        {
                          x: 1604,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1190,
                        },
                        {
                          x: 1604,
                          y: 1190,
                        },
                      ],
                    ],
                    value: "85500.00",
                  },
                  {
                    id: 17,
                    key: "密码区",
                    position: [
                      [
                        {
                          x: 1240,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 668,
                        },
                        {
                          x: 1240,
                          y: 668,
                        },
                      ],
                    ],
                    value:
                      "4*6<-30*065/+>5-6510*888*944<//343>88+-591/951><935-8+9++>68/985</>550+-5/17080/88/969244/5+-77<1<6<592>0>57",
                  },
                  {
                    id: 18,
                    key: "收款人",
                    position: [
                      [
                        {
                          x: 238,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1438,
                        },
                        {
                          x: 238,
                          y: 1438,
                        },
                      ],
                    ],
                    value: "贺",
                  },
                  {
                    id: 19,
                    key: "复核",
                    position: [
                      [
                        {
                          x: 731,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1440,
                        },
                        {
                          x: 731,
                          y: 1440,
                        },
                      ],
                    ],
                    value: "李",
                  },
                  {
                    id: 20,
                    key: "开票人",
                    position: [
                      [
                        {
                          x: 1198,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1448,
                        },
                        {
                          x: 1198,
                          y: 1448,
                        },
                      ],
                    ],
                    value: "肖",
                  },
                ],
                commodity: [
                  [
                    {
                      id: 1,
                      key: "商品名称",
                      position: [
                        [
                          {
                            x: 77,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 790,
                          },
                          {
                            x: 77,
                            y: 790,
                          },
                        ],
                      ],
                      value: "*化学合成材料*胶水",
                    },
                    {
                      id: 2,
                      key: "商品规格型号",
                      position: [
                        [
                          {
                            x: 554,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 792,
                          },
                          {
                            x: 554,
                            y: 792,
                          },
                        ],
                      ],
                      value: "802.62D",
                    },
                    {
                      id: 3,
                      key: "商品单位",
                      position: [
                        [
                          {
                            x: 839,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 796,
                          },
                          {
                            x: 839,
                            y: 796,
                          },
                        ],
                      ],
                      value: "KG",
                    },
                    {
                      id: 4,
                      key: "商品数量",
                      position: [
                        [
                          {
                            x: 1033,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 799,
                          },
                          {
                            x: 1033,
                            y: 799,
                          },
                        ],
                      ],
                      value: "2000",
                    },
                    {
                      id: 5,
                      key: "商品单价",
                      position: [
                        [
                          {
                            x: 1139,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 794,
                          },
                          {
                            x: 1139,
                            y: 794,
                          },
                        ],
                      ],
                      value: "37.831858407",
                    },
                    {
                      id: 6,
                      key: "商品金额",
                      position: [
                        [
                          {
                            x: 1470,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 796,
                          },
                          {
                            x: 1470,
                            y: 796,
                          },
                        ],
                      ],
                      value: "75663.72",
                    },
                    {
                      id: 7,
                      key: "商品税率",
                      position: [
                        [
                          {
                            x: 1645,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 798,
                          },
                          {
                            x: 1645,
                            y: 798,
                          },
                        ],
                      ],
                      value: "13%",
                    },
                    {
                      id: 8,
                      key: "商品税额",
                      position: [
                        [
                          {
                            x: 1873,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 803,
                          },
                          {
                            x: 1873,
                            y: 803,
                          },
                        ],
                      ],
                      value: "9836.28",
                    },
                  ],
                ],
                others: [
                  {
                    id: 1,
                    key: "发票联号",
                    position: [
                      [
                        {
                          x: 2014,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 944,
                        },
                        {
                          x: 2014,
                          y: 944,
                        },
                      ],
                    ],
                    value: "第一联:记账联",
                  },
                  {
                    id: 2,
                    key: "备注",
                    position: [[]],
                    value: "",
                  },
                ],
              },
            ],
            angle: 0,
            json: {},
          },
        ],
      },
      {
        name: "vat2",
        data: [
          {
            isexample: true,
            taskId: "U2024011209740513",
            status: 1,
            fileName: "vat2-vat1.png",
            imagePath,
            height: 1560,
            width: 2080,
            content: [
              {
                info: [
                  {
                    id: 1,
                    key: "发票代码",
                    position: [
                      [
                        {
                          x: 258,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 351,
                        },
                        {
                          x: 258,
                          y: 351,
                        },
                      ],
                    ],
                    value: "5000210330",
                  },
                  {
                    id: 2,
                    key: "发票号码",
                    position: [
                      [
                        {
                          x: 1433,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 398,
                        },
                        {
                          x: 1433,
                          y: 398,
                        },
                      ],
                    ],
                    value: "22968322",
                  },
                  {
                    id: 3,
                    key: "发票日期",
                    position: [
                      [
                        {
                          x: 1703,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 455,
                        },
                        {
                          x: 1703,
                          y: 455,
                        },
                      ],
                    ],
                    value: "2021年06月05日",
                  },
                  {
                    id: 4,
                    key: "校验码（后六位）",
                    position: [[]],
                    value: "",
                  },
                  {
                    id: 5,
                    key: "购买方名称",
                    position: [
                      [
                        {
                          x: 568,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 538,
                        },
                        {
                          x: 568,
                          y: 538,
                        },
                      ],
                    ],
                    value: "材料有限公司",
                  },
                  {
                    id: 6,
                    key: "购买方纳税人识别号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 593,
                        },
                        {
                          x: 380,
                          y: 593,
                        },
                      ],
                    ],
                    value: "91347583MA3TDEF5N",
                  },
                  {
                    id: 7,
                    key: "购买方地址及电话",
                    position: [
                      [
                        {
                          x: 376,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 636,
                        },
                        {
                          x: 376,
                          y: 636,
                        },
                      ],
                    ],
                    value: "安徽省池州市010-93470823",
                  },
                  {
                    id: 8,
                    key: "购买方开户行及账号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 690,
                        },
                        {
                          x: 380,
                          y: 690,
                        },
                      ],
                    ],
                    value: "中国农业银行池州江南支行12984793403940814",
                  },
                  {
                    id: 9,
                    key: "销售方名称",
                    position: [
                      [
                        {
                          x: 644,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1257,
                        },
                        {
                          x: 644,
                          y: 1257,
                        },
                      ],
                    ],
                    value: "粘胶厂",
                  },
                  {
                    id: 10,
                    key: "销售方纳税人识别号",
                    position: [
                      [
                        {
                          x: 434,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1304,
                        },
                        {
                          x: 434,
                          y: 1304,
                        },
                      ],
                    ],
                    value: "917438480038080939",
                  },
                  {
                    id: 11,
                    key: "销售方地址及电话",
                    position: [
                      [
                        {
                          x: 392,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1346,
                        },
                        {
                          x: 392,
                          y: 1346,
                        },
                      ],
                    ],
                    value: "广州市白云区020-73905280",
                  },
                  {
                    id: 12,
                    key: "销售方开户行及账号",
                    position: [
                      [
                        {
                          x: 386,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1395,
                        },
                        {
                          x: 386,
                          y: 1395,
                        },
                      ],
                    ],
                    value: "广州农村商业银行白云新城支行3507034703020314",
                  },
                  {
                    id: 13,
                    key: "不含税总金额",
                    position: [
                      [
                        {
                          x: 1389,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1123,
                        },
                        {
                          x: 1389,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "75663.72",
                  },
                  {
                    id: 14,
                    key: "总税额",
                    position: [
                      [
                        {
                          x: 1797,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1123,
                        },
                        {
                          x: 1797,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "9836.28",
                  },
                  {
                    id: 15,
                    key: "价税合计大写",
                    position: [
                      [
                        {
                          x: 595,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1188,
                        },
                        {
                          x: 595,
                          y: 1188,
                        },
                      ],
                    ],
                    value: "捌万伍仟伍佰圆整",
                  },
                  {
                    id: 16,
                    key: "价税合计小写",
                    position: [
                      [
                        {
                          x: 1604,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1190,
                        },
                        {
                          x: 1604,
                          y: 1190,
                        },
                      ],
                    ],
                    value: "85500.00",
                  },
                  {
                    id: 17,
                    key: "密码区",
                    position: [
                      [
                        {
                          x: 1240,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 668,
                        },
                        {
                          x: 1240,
                          y: 668,
                        },
                      ],
                    ],
                    value:
                      "4*6<-30*065/+>5-6510*888*944<//343>88+-591/951><935-8+9++>68/985</>550+-5/17080/88/969244/5+-77<1<6<592>0>57",
                  },
                  {
                    id: 18,
                    key: "收款人",
                    position: [
                      [
                        {
                          x: 238,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1438,
                        },
                        {
                          x: 238,
                          y: 1438,
                        },
                      ],
                    ],
                    value: "贺",
                  },
                  {
                    id: 19,
                    key: "复核",
                    position: [
                      [
                        {
                          x: 731,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1440,
                        },
                        {
                          x: 731,
                          y: 1440,
                        },
                      ],
                    ],
                    value: "李",
                  },
                  {
                    id: 20,
                    key: "开票人",
                    position: [
                      [
                        {
                          x: 1198,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1448,
                        },
                        {
                          x: 1198,
                          y: 1448,
                        },
                      ],
                    ],
                    value: "肖",
                  },
                ],
                commodity: [
                  [
                    {
                      id: 1,
                      key: "商品名称",
                      position: [
                        [
                          {
                            x: 77,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 790,
                          },
                          {
                            x: 77,
                            y: 790,
                          },
                        ],
                      ],
                      value: "*化学合成材料*胶水",
                    },
                    {
                      id: 2,
                      key: "商品规格型号",
                      position: [
                        [
                          {
                            x: 554,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 792,
                          },
                          {
                            x: 554,
                            y: 792,
                          },
                        ],
                      ],
                      value: "802.62D",
                    },
                    {
                      id: 3,
                      key: "商品单位",
                      position: [
                        [
                          {
                            x: 839,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 796,
                          },
                          {
                            x: 839,
                            y: 796,
                          },
                        ],
                      ],
                      value: "KG",
                    },
                    {
                      id: 4,
                      key: "商品数量",
                      position: [
                        [
                          {
                            x: 1033,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 799,
                          },
                          {
                            x: 1033,
                            y: 799,
                          },
                        ],
                      ],
                      value: "2000",
                    },
                    {
                      id: 5,
                      key: "商品单价",
                      position: [
                        [
                          {
                            x: 1139,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 794,
                          },
                          {
                            x: 1139,
                            y: 794,
                          },
                        ],
                      ],
                      value: "37.831858407",
                    },
                    {
                      id: 6,
                      key: "商品金额",
                      position: [
                        [
                          {
                            x: 1470,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 796,
                          },
                          {
                            x: 1470,
                            y: 796,
                          },
                        ],
                      ],
                      value: "75663.72",
                    },
                    {
                      id: 7,
                      key: "商品税率",
                      position: [
                        [
                          {
                            x: 1645,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 798,
                          },
                          {
                            x: 1645,
                            y: 798,
                          },
                        ],
                      ],
                      value: "13%",
                    },
                    {
                      id: 8,
                      key: "商品税额",
                      position: [
                        [
                          {
                            x: 1873,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 803,
                          },
                          {
                            x: 1873,
                            y: 803,
                          },
                        ],
                      ],
                      value: "9836.28",
                    },
                  ],
                ],
                others: [
                  {
                    id: 1,
                    key: "发票联号",
                    position: [
                      [
                        {
                          x: 2014,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 944,
                        },
                        {
                          x: 2014,
                          y: 944,
                        },
                      ],
                    ],
                    value: "第一联:记账联",
                  },
                  {
                    id: 2,
                    key: "备注",
                    position: [[]],
                    value: "",
                  },
                ],
              },
            ],
            angle: 0,
            json: {},
          },
          {
            isexample: true,
            taskId: "U2024011209740513",
            status: 1,
            fileName: "vat2-vat2.png",
            imagePath,
            height: 1560,
            width: 2080,
            content: [
              {
                info: [
                  {
                    id: 1,
                    key: "发票代码2",
                    position: [
                      [
                        {
                          x: 258,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 297,
                        },
                        {
                          x: 611,
                          y: 351,
                        },
                        {
                          x: 258,
                          y: 351,
                        },
                      ],
                    ],
                    value: "5000210330",
                  },
                  {
                    id: 2,
                    key: "发票号码2",
                    position: [
                      [
                        {
                          x: 1433,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 292,
                        },
                        {
                          x: 1990,
                          y: 398,
                        },
                        {
                          x: 1433,
                          y: 398,
                        },
                      ],
                    ],
                    value: "22968322",
                  },
                  {
                    id: 3,
                    key: "发票日期",
                    position: [
                      [
                        {
                          x: 1703,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 418,
                        },
                        {
                          x: 1955,
                          y: 455,
                        },
                        {
                          x: 1703,
                          y: 455,
                        },
                      ],
                    ],
                    value: "2021年06月05日",
                  },
                  {
                    id: 4,
                    key: "校验码（后六位）",
                    position: [[]],
                    value: "",
                  },
                  {
                    id: 5,
                    key: "购买方名称",
                    position: [
                      [
                        {
                          x: 568,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 499,
                        },
                        {
                          x: 772,
                          y: 538,
                        },
                        {
                          x: 568,
                          y: 538,
                        },
                      ],
                    ],
                    value: "材料有限公司",
                  },
                  {
                    id: 6,
                    key: "购买方纳税人识别号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 548,
                        },
                        {
                          x: 904,
                          y: 593,
                        },
                        {
                          x: 380,
                          y: 593,
                        },
                      ],
                    ],
                    value: "91347583MA3TDEF5N",
                  },
                  {
                    id: 7,
                    key: "购买方地址及电话",
                    position: [
                      [
                        {
                          x: 376,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 605,
                        },
                        {
                          x: 1094,
                          y: 636,
                        },
                        {
                          x: 376,
                          y: 636,
                        },
                      ],
                    ],
                    value: "安徽省池州市010-93470823",
                  },
                  {
                    id: 8,
                    key: "购买方开户行及账号",
                    position: [
                      [
                        {
                          x: 380,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 660,
                        },
                        {
                          x: 1092,
                          y: 690,
                        },
                        {
                          x: 380,
                          y: 690,
                        },
                      ],
                    ],
                    value: "中国农业银行池州江南支行12984793403940814",
                  },
                  {
                    id: 9,
                    key: "销售方名称",
                    position: [
                      [
                        {
                          x: 644,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1220,
                        },
                        {
                          x: 739,
                          y: 1257,
                        },
                        {
                          x: 644,
                          y: 1257,
                        },
                      ],
                    ],
                    value: "粘胶厂",
                  },
                  {
                    id: 10,
                    key: "销售方纳税人识别号",
                    position: [
                      [
                        {
                          x: 434,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1267,
                        },
                        {
                          x: 916,
                          y: 1304,
                        },
                        {
                          x: 434,
                          y: 1304,
                        },
                      ],
                    ],
                    value: "917438480038080939",
                  },
                  {
                    id: 11,
                    key: "销售方地址及电话",
                    position: [
                      [
                        {
                          x: 392,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1318,
                        },
                        {
                          x: 1106,
                          y: 1346,
                        },
                        {
                          x: 392,
                          y: 1346,
                        },
                      ],
                    ],
                    value: "广州市白云区020-73905280",
                  },
                  {
                    id: 12,
                    key: "销售方开户行及账号",
                    position: [
                      [
                        {
                          x: 386,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1358,
                        },
                        {
                          x: 1100,
                          y: 1395,
                        },
                        {
                          x: 386,
                          y: 1395,
                        },
                      ],
                    ],
                    value: "广州农村商业银行白云新城支行3507034703020314",
                  },
                  {
                    id: 13,
                    key: "不含税总金额",
                    position: [
                      [
                        {
                          x: 1389,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1088,
                        },
                        {
                          x: 1604,
                          y: 1123,
                        },
                        {
                          x: 1389,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "75663.72",
                  },
                  {
                    id: 14,
                    key: "总税额",
                    position: [
                      [
                        {
                          x: 1797,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1094,
                        },
                        {
                          x: 1984,
                          y: 1123,
                        },
                        {
                          x: 1797,
                          y: 1123,
                        },
                      ],
                    ],
                    value: "9836.28",
                  },
                  {
                    id: 15,
                    key: "价税合计大写",
                    position: [
                      [
                        {
                          x: 595,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1147,
                        },
                        {
                          x: 940,
                          y: 1188,
                        },
                        {
                          x: 595,
                          y: 1188,
                        },
                      ],
                    ],
                    value: "捌万伍仟伍佰圆整",
                  },
                  {
                    id: 16,
                    key: "价税合计小写",
                    position: [
                      [
                        {
                          x: 1604,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1153,
                        },
                        {
                          x: 1844,
                          y: 1190,
                        },
                        {
                          x: 1604,
                          y: 1190,
                        },
                      ],
                    ],
                    value: "85500.00",
                  },
                  {
                    id: 17,
                    key: "密码区",
                    position: [
                      [
                        {
                          x: 1240,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 510,
                        },
                        {
                          x: 1915,
                          y: 668,
                        },
                        {
                          x: 1240,
                          y: 668,
                        },
                      ],
                    ],
                    value:
                      "4*6<-30*065/+>5-6510*888*944<//343>88+-591/951><935-8+9++>68/985</>550+-5/17080/88/969244/5+-77<1<6<592>0>57",
                  },
                  {
                    id: 18,
                    key: "收款人",
                    position: [
                      [
                        {
                          x: 238,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1401,
                        },
                        {
                          x: 276,
                          y: 1438,
                        },
                        {
                          x: 238,
                          y: 1438,
                        },
                      ],
                    ],
                    value: "贺",
                  },
                  {
                    id: 19,
                    key: "复核",
                    position: [
                      [
                        {
                          x: 731,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1407,
                        },
                        {
                          x: 782,
                          y: 1440,
                        },
                        {
                          x: 731,
                          y: 1440,
                        },
                      ],
                    ],
                    value: "李",
                  },
                  {
                    id: 20,
                    key: "开票人",
                    position: [
                      [
                        {
                          x: 1198,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1413,
                        },
                        {
                          x: 1243,
                          y: 1448,
                        },
                        {
                          x: 1198,
                          y: 1448,
                        },
                      ],
                    ],
                    value: "肖",
                  },
                ],
                commodity: [
                  [
                    {
                      id: 1,
                      key: "商品名称",
                      position: [
                        [
                          {
                            x: 77,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 761,
                          },
                          {
                            x: 372,
                            y: 790,
                          },
                          {
                            x: 77,
                            y: 790,
                          },
                        ],
                      ],
                      value: "*化学合成材料*胶水",
                    },
                    {
                      id: 2,
                      key: "商品规格型号",
                      position: [
                        [
                          {
                            x: 554,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 763,
                          },
                          {
                            x: 678,
                            y: 792,
                          },
                          {
                            x: 554,
                            y: 792,
                          },
                        ],
                      ],
                      value: "802.62D",
                    },
                    {
                      id: 3,
                      key: "商品单位",
                      position: [
                        [
                          {
                            x: 839,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 763,
                          },
                          {
                            x: 887,
                            y: 796,
                          },
                          {
                            x: 839,
                            y: 796,
                          },
                        ],
                      ],
                      value: "KG",
                    },
                    {
                      id: 4,
                      key: "商品数量",
                      position: [
                        [
                          {
                            x: 1033,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 763,
                          },
                          {
                            x: 1111,
                            y: 799,
                          },
                          {
                            x: 1033,
                            y: 799,
                          },
                        ],
                      ],
                      value: "2000",
                    },
                    {
                      id: 5,
                      key: "商品单价",
                      position: [
                        [
                          {
                            x: 1139,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 763,
                          },
                          {
                            x: 1312,
                            y: 794,
                          },
                          {
                            x: 1139,
                            y: 794,
                          },
                        ],
                      ],
                      value: "37.831858407",
                    },
                    {
                      id: 6,
                      key: "商品金额",
                      position: [
                        [
                          {
                            x: 1470,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 763,
                          },
                          {
                            x: 1608,
                            y: 796,
                          },
                          {
                            x: 1470,
                            y: 796,
                          },
                        ],
                      ],
                      value: "75663.72",
                    },
                    {
                      id: 7,
                      key: "商品税率",
                      position: [
                        [
                          {
                            x: 1645,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 766,
                          },
                          {
                            x: 1705,
                            y: 798,
                          },
                          {
                            x: 1645,
                            y: 798,
                          },
                        ],
                      ],
                      value: "13%",
                    },
                    {
                      id: 8,
                      key: "商品税额",
                      position: [
                        [
                          {
                            x: 1873,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 763,
                          },
                          {
                            x: 1996,
                            y: 803,
                          },
                          {
                            x: 1873,
                            y: 803,
                          },
                        ],
                      ],
                      value: "9836.28",
                    },
                  ],
                ],
                others: [
                  {
                    id: 1,
                    key: "发票联号",
                    position: [
                      [
                        {
                          x: 2014,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 705,
                        },
                        {
                          x: 2060,
                          y: 944,
                        },
                        {
                          x: 2014,
                          y: 944,
                        },
                      ],
                    ],
                    value: "第一联:记账联",
                  },
                  {
                    id: 2,
                    key: "备注",
                    position: [[]],
                    value: "",
                  },
                ],
              },
            ],
            angle: 0,
            json: {},
          },
        ],
      },
    ]
  },

];

export { data };
